src/test/java/features/requests/delete_request_detective.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:detectiveServiceRequest>
            <gs:detective>
                <gs:id>@@detectiveId@@</gs:id>
            </gs:detective>
        </gs:detectiveServiceRequest>
    </soapenv:Body>
</soapenv:Envelope>